/** @file

Copyright (c) 2006 - 2014, Byosoft Corporation.<BR>
All rights reserved.This software and associated documentation (if any)
is furnished under a license and may only be used or copied in
accordance with the terms of the license. Except as permitted by such
license, no part of this software or documentation may be reproduced,
stored in a retrieval system, or transmitted in any form or by any
means without the express written consent of Byosoft Corporation.

File Name:
  Uart.uni

Abstract:
  The definition of string used in  UART Setup setting.

Revision History:

$END--------------------------------------------------------------------

**/

/=#
#langdef   en-US "English"
#langdef   zh-Hans "\wide中文\narrow"

 
#string STR_UART_FORM                     #language en-US "Uart Configuration"
                                           #language zh-Hans "\wide显示菜单\narrow"
#string STR_EMPTY                              #language en-US " "
#string STR_UART_MODE                                #language en-US "Onchip UART Mode"
#string STR_UART_MODE_HELP                                #language en-US "UART Legacy/PCI Mode Switc"
#string STR_DISABLED                      #language en-US "Disabled"
#string STR_ENABLED                              #language en-US "Enabled"
#string STR_PCI_UART                                 #language en-US "Enable"

#string STR_UART_MODE_SEL                                 #language en-US "PCI UART mode Selection "
#string STR_UART_MODE_SEL_HELP                                 #language en-US "UART module Selection"
#string STR_LEGACY                                 #language en-US "Legacy"
#string STR_PCI_DMA                                 #language en-US "PCI DMA Mode"
#string STR_PCI_COMPATIBLE                                 #language en-US "PCI Compatible Mode"
#string STR_UART0_EN                           #language en-US "UART 0 Enable"
#string STR_UART0_BASE_SEL                           #language en-US " Io Base"
#string STR_UART0_BASE_SEL_HELP                           #language en-US " Select the Io Base of UART"
#string STR_UART0_EN_8PIN                          #language en-US "Select 8Pin Uart0"
#string STR_UART0_EN_8PIN_SEL_HELP                           #language en-US " Set Uart0 to 8 Pin and Uart1 will be disable automatically"
#string STR_3F8                      #language en-US "3F8"
#string STR_2F8                              #language en-US "2F8"
#string STR_3E8                                #language en-US "3E8"
#string STR_2E8                               #language en-US "2E8"


#string STR_UART0_IRQ                           #language en-US " IRQ"
#string STR_UART0_IRQ_HELP                           #language en-US " Select the IRQ of UART"
#string STR_3                          #language en-US "3"
#string STR_4                           #language en-US "4"
#string STR_7                           #language en-US "7"
#string STR_11                      #language en-US "11"
#string STR_UART1_EN                           #language en-US "UART 1 Enable"
#string STR_UART1_BASE_SEL                           #language en-US " Io Base"
#string STR_UART1_IRQ                           #language en-US " IRQ"
#string STR_UART2_EN                           #language en-US "UART 2 Enable"
#string STR_UART2_BASE_SEL                           #language en-US " Io Base"
#string STR_UART2_IRQ                           #language en-US " IRQ"
#string STR_UART3_EN                           #language en-US "UART 3 Enable"
#string STR_UART3_BASE_SEL                           #language en-US " Io Base"
#string STR_UART3_IRQ                           #language en-US " IRQ"
#string STR_UART_FLR_EN                           #language en-US "UART FLR Support"   